<?php

return [
    'activation' => [
        'title' => 'تفعيل الحساب',
        'logo_alt' => 'شعار جولة',
        'greeting_ar' => 'مرحباً، :name',
        'greeting_en' => 'Hello :name,',
        'thank_you' => 'شكراً لتسجيلك في تطبيق .',
        'use_code' => 'يرجى استخدام كود التفعيل أدناه لإكمال عملية التسجيل وتفعيل حسابك:',
        'ignore' => 'إذا لم تقم بطلب هذا الكود، يمكنك تجاهل هذه الرسالة.',
        'wish' => 'نتمنى لك تجربة ممتعة ومميزة مع تطبيق جولة (ATOUR)!',
        'team' => 'فريق جولة',
    ],
];
